tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-fonts"

# Essentials
brew "git"
brew "fish"
brew "tmux"

# Tooling
brew 'ack'
brew 'tldr'
brew 'wget'
brew 'imagemagick'
brew 'dsh'

# Editors
brew 'vim'
brew 'the_silver_searcher'

# Ruby
brew "ruby-install"
brew "chruby"
brew "chruby-fish"
brew "gel"

# Javascript
brew 'nvm'

# Databases
brew 'mysql', restart_service: true

# Dev-dependencies
brew 'libgit2' 
brew 'cmake'
brew 'pkg-config'

# AWS
brew 'awscli@2'
brew 'terraform'

# Casks
cask "font-fira-code"
cask 'google-chrome'
cask 'spotify'
cask 'ngrok'
cask 'slack'
