tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "aws/tap"
tap "exercism/wren"
tap "stripe/stripe-cli"

# My products
brew "exercism"

# Essentials
brew "git"
brew "git-lfs"
brew "gh"
brew "fish"
brew "tmux"
brew "openssl"

# Tooling
brew 'ack'
brew 'tldr'
brew 'wget'
brew 'imagemagick'
brew 'dsh'
brew 'vips'

# Editors
brew 'vim'
brew 'the_silver_searcher'

# Ruby
brew "ruby-install"
brew "chruby"
brew "chruby-fish"
brew "gel"
brew "anycable-go"
brew "hivemind"
brew "proj"

# Other Languages
brew 'nvm'
brew 'nim'
brew 'wren-console'
brew 'python@3.10'
brew 'python-tk'
brew 'pillow' # Python imaging library
brew 'opencv' # Python opencv library

# Databases
brew 'mysql', restart_service: true
brew 'redis', restart_service: true

# Dev-dependencies
brew 'libgit2' 
brew 'cmake'
brew 'pkg-config'

# AWS
brew 'awscli@2'
brew 'terraform'
brew 'aws-sam-cli'

# Misc Dev things
brew 'zmq'
brew 'stripe/stripe-cli/stripe'

# Casks
cask "font-fira-code"
cask 'google-chrome'
cask 'spotify'
cask 'ngrok'
cask 'slack'
cask 'keycastr'
